# ExternalResourceLoadContent Properties

---
The ExternalResourceLoadContent type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LoadStatus|  A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
| Version|  The version of the external data that the server is providing in this object.
Top
#### Reference
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace